"""
1. Создать класс TrafficLight (светофор).
определить у него один атрибут color (цвет) и метод running (запуск);
атрибут реализовать как приватный;
в рамках метода реализовать переключение светофора в режимы: красный, жёлтый, зелёный;
продолжительность первого состояния (красный) составляет 7 секунд, второго (жёлтый) — 2 секунды, третьего (зелёный) — на ваше усмотрение;
переключение между режимами должно осуществляться только в указанном порядке (красный, жёлтый, зелёный);
проверить работу примера, создав экземпляр и вызвав описанный метод.
Задачу можно усложнить, реализовав проверку порядка режимов. При его нарушении выводить соответствующее сообщение и завершать скрипт.
"""
import time

class TrafficLight:

    def __init__(self, color):
        self.__color = color

    def __del__(self):

        while True:
            print(f'-=Красный=-.  Переключение на Желтый свет через 7 секунд')
            time.sleep(7)

            print(f' -=Желтый=-.  Переключение на Зеленый свет через 2 секунд')
            time.sleep(2)

            print(f'-=Зеленый=-.  Переключение на Красный свет через 6 секунд')
            time.sleep(6)

    def show(self):

        while True:

                if self.__color == "Красный":
                    break
                elif self.__color == "Желтый":
                    print(f' -=Желтый=-.  Переключение на Зеленый свет через 2 секунд')
                    time.sleep(2)
                    print(f'-=Зеленый=-.  Переключение на Красный свет через 6 секунд')
                    time.sleep(6)
                    break
                elif self.__color == "Зеленый":
                    print(f'-=Зеленый=-.  Переключение на Красный свет через 6 секунд')
                    time.sleep(6)
                    break

s1 = TrafficLight("Красный")
s1.show()
