"""
2. Реализовать класс Road (дорога).
определить атрибуты: length (длина), width (ширина);
значения атрибутов должны передаваться при создании экземпляра класса;
атрибуты сделать защищёнными;
определить метод расчёта массы асфальта, необходимого для покрытия всей дороги;
использовать формулу: длина * ширина * масса асфальта для покрытия одного кв. метра дороги асфальтом, толщиной в 1 см * число см толщины полотна;
проверить работу метода.
Например: 20 м*5000 м*25 кг*5 см = 12500 т.
"""

class Road:

    def __init__(self, width, length):
        self._width = width
        self._length = length

    def mass_gost_road(self):
        GOST_MASS = 25
        GOST_DEPTH = 5
        mass = (self._width * self._length * GOST_MASS * GOST_DEPTH)/1000
        print(f'Норматив ГОСТ, масса на 1м2 толщиной 1см равна {GOST_MASS} кг')
        print(f'Норматив ГОСТ, толщина в вашем регионе равна {GOST_DEPTH/100} метра')
        print(f'Масса асфальтового покрытия по ГОСТУ, равна {mass} т.')

in_data = Road(20, 5000)
in_data.mass_gost_road()